
import citiesData from './combined_Persian_English.js';

// Sample agents object containing agent names
const agentsObject = {
  agentName: ['YAX', 'Tirajeh', 'Pishgaman', 'ide', 'پیشگامان سخت افزار تیراژه', 'زاگرس'],
};

const citiesArray =["هشتگرد", "کرج", "کمال شهر", "باغستان", "چهارباغ", "اشتهارد", "فردیس", "گرمدره", "گوهردشت", "گلشهر", "هشتگرد", "حصارک", "کرج", "کلاک", "ماهدشت", "ملارد", "مشکیندشت", "محمد شهر", "نظرآباد", "نسا", "رجایی شهر", "صفادشت", "سرآسیاب", "ساوجبلاغ", "طالقان", "اندیشه", "اردبیل", "اردبیل", "اصلان دوز", "بیله سوار", "گرمی", "خلخال", "کوثر", "مشگین شهر", "نمین", "نیر", "پارس آباد", "سرعین", "تازه کند انگوت", "گرمی", "بازرگان", "سروو", "باروق", "بوکان", "چهار برج", "چالدران", "چایپاره", "خوی", "مهاباد", "ماکو", "میاندوآب", "نقده", "ارومیه", "اشنویه", "پیرانشهر", "پلدشت", "قره ضیاء الدین", "سلماس", "سردشت", "شاهیندژ", "شوت", "تکاب", "اهر", "عجب شیر", "آذرشهر", "بناب", "بستان آباد", "چارویماق", "گوگان", "هادیشهر", "هشترود", "هریس", "هوراند", "جلفا", "کلیبر", "خدا آفرین", "کوزه کنان", "ملکان", "مراغه", "مرند", "مهرابان", "میانه", "اسکو", "قره آغاج", "سهند", "سراب", "شبستر", "تبریز", "تاسوج", "ورزقان", "قره آغاج", "مهاباد", "خوی", "ارومیه", "بوکان", "تبریز", "مراغه", "مرند", "عسلویه", "گناوه", "برازجان", "بوشهر", "نخل تقی", "سعدآباد", "سهمو جنوبی", "سهمو شمالی", "سیراف", "تنگ ارم", "تنگستان", "وحدتیه", "زبار", "آبدان", "بردخون", "اهرم", "اهرم", "آخوند", "عالیشهر", "عسلویه", "بدوله", "دکل بندر", "بساتین", "بنود", "برازجان", "بوشهر", "چاهمبارک", "چغادک", "دشت پلنگ", "دشتستان", "دشتی", "روز", "دلوار", "دیلم", "گناوه", "هاله", "مربا", "کنگان", "خارک", "خورموج", "لاور ساحلی", "اردل", "باباحیدر", "بازفت", "بن", "بولداجی", "بروجن", "چلگرد", "فرخ شهر", "فارسان", "گهرو", "هفشجان", "جونقان", "خانمیرزا", "کیار", "کوهرنگ", "لردگان", "سامان", "صمصامی", "شهرکرد", "سورشجان", "جونگان", "مال خلیفه", "شهرکرد", "منطقه 1", "منطقه 2", "منطقه 3", "منطقه 4", "منطقه 5", "منطقه 6", "منطقه 7", "بهارستان", "اصفهان", "فریدن", "فریدونشهر", "فولاد شهر", "فولادموبارکه", "فولادشهر", "قهدریجان", "قالشور", "گلپایگان", "گوگاد", "هراند", "هونهجان", "کاشان", "کلیشاد", "خوانسار", "خرزوق", "خزاق", "خمینی شهر", "خور و بیابانک", "کوهپایه", "لانگان", "لنجان", "مجلسی", "میمه", "مبارکه", "مبارکه", "نایین", "نجف آباد", "نطنز", "نیک آباد", "نوش آباد", "پیربکران", "رامشه", "روستای ایشن", "سمیرم", "سپاهان شهر", "شاهین شهر", "شهرضا", "تیران و کاروان", "ورنامخواست", "ورزنه", "زرین شهر", "درچه", "دنبی", "حسن آباد", "ملواجرد", "نائین", "زواره", "آران و بیدگل", "اردستان", "بادرود", "باغبهادران", "بهارستان", "بیده", "برخوار", "بوئین و میاندشت", "چادگان", "چرخاب", "داران", "دستگردبرخوار", "دهاقان", "دریس", "دولت آباد", "اصفهان", "فلاورجان", "شیراز", "میمند", "هماشهر", "آباده", "ارسنجان", "بهمن", "باجگاه", "بوانات", "بیزا", "بیگارد", "بیشابور", "بوراک", "داراب", "اقلید", "اشکانان", "استهبان", "اواز", "فراشبند", "فسا", "فیروزآباد", "فیش ور", "گاله در", "گراش", "حاجی آباد", "هرمود", "جهرم", "جویوم", "کارزین", "کوار", "کازرون", "خفر", "خرامه", "خنج", "خرمبید", "کورده", "لامرد", "لار", "لارستان", "ممسنی", "مرودشت", "مهر", "نی ریز", "نورآباد", "پاسارگاد", "قیر و کارزین", "رستم", "صدرا", "صفاشهر", "سرچهان", "سروستان", "سپیدان", "شیراز", "زرقان", "زرین دشت", "رشت", "بندر انزلی", "املش", "آستانه اشرفیه", "آستارا", "بندر انزلی", "چابکسر", "فومن", "خمام", "خشکبیجار", "کوچصفهان", "لاهیجان", "لنگرود", "لوشان", "منجیل", "ماسال", "رشت", "رضوانشهر", "رودبار", "رودسر", "سنگر", "شفت", "سیاهکل", "صومعه سارا", "تالش", "علی آباد", "آق قلا", "یاسگانی", "آزادشهر", "بندرگز", "بندرترکمان", "فاضل آباد", "گالیکش", "گمیشان", "گنبدکاووس", "گرگان", "کلاله", "خانببین", "کردکوی", "مراوه تپه", "مینودشت", "رامیان", "گرگان", "گنبدکاووس", "همدان", "جوکار", "اسدآباد", "بهار", "فامنین", "گروه درجزین", "همدان", "کبودرآهنگ", "لالجین", "ملایر", "ملا بوداق", "نهاوند", "کارخانه سیمان نهاوند", "قهاوند", "رزن", "شیرین سو", "شیرینسو", "تویسرکان", "ابوموسا", "بندرعباس", "بندر لنگه", "بشاگرد", "بستک", "درگهان", "فارور", "تنب عالی", "حاجی آباد", "هانگویه", "هندورابی", "هنگام", "هرمز", "جاسک", "خمیر", "کیش", "لارک", "لاوان", "تنب کوچک", "میناب", "پارسیان", "قشم", "رودان", "شهر جدید علوی", "سیری", "سیریک", "جدول", "حاجی آباد", "بندرعباس", "کیش", "جاسک", "ایلام", "بالاوه", "آبدانان", "ارکواز", "بدره", "چرداول", "چوار", "دره شهر", "دهلران", "ایوان", "هولیلان", "ایلام", "لومار", "مهران", "سرابله", "ملکشاهی", "شیروان", "انار", "عنبرآباد", "آرزویه", "بافت", "بهرمان", "بام", "بردسیر", "درب بهشت", "فهرج", "فاریاب", "جیرفت", "کهنوج", "کرمان", "کوشکویه", "کوهبنان", "منوجان", "مس سرچشمه", "نرماشیر", "قلعه گنج", "رابر", "رفسنجان", "راور", "ریگان", "رودبار جنوب", "صفاییه", "شهربابک", "سیریز", "سیرجان", "زرند", "راین", "بهرامان", "کرمان", "جیرفت", "کرمانشاه", "اسلام آباد غرب", "بیستون", "دالاهو", "اسلام آباد غرب", "گیلانغرب", "هرسین", "جوانرود", "کنگاور", "کرند غرب", "کرمانشاه", "پاوه", "قصرشیرین", "روانسر", "صحنه", "ثلاث باباجانی", "سرپل ذهاب", "سنقر", "تازه آباد", "آرین شهر", "اسدیه", "بیرجند", "بشرویه", "درمیان", "عشق آباد", "فردوس", "حاجی آباد", "خضری", "خوسف", "نهبندان", "قاین", "سرایان", "سربیشه", "طبس", "زیرکوه", "بجستان", "باخارز", "بردسکن", "بینالود", "چاپشلو", "چناران", "درگز", "دارکالات", "دررود", "داورزن", "فریمان", "فیض آباد", "فیروزه", "گلبهار", "گناباد", "جغتای", "جواین", "کلات", "کاشمر", "خواف", "خلیل آباد", "خوشاب", "کوهسرخ", "مهولت", "مشهد", "نصرآباد", "نگهاب", "نیشابور", "قاسم آباد", "قوچان", "ریواش", "رشتخوار", "سبزوار", "صالح آباد", "سرخس", "شاندیز", "ششتومد", "تایباد", "تربت حیدریه", "تربت جام", "طرقبه", "زاوه", "زبرخان", "آشخانه", "بجنورد", "اسفراین", "فاروج", "گرمه", "جاجرم", "مانه و سملقان", "راز و جرگلان", "صفی آباد", "شیروان", "بیرجند", "نیشابور", "مشهد", "بجنورد", "اسفراین", "دزفول", "ماهشهر", "اهواز", "منطقه آزاد اروند", "آبادان", "آبادان", "آغاجاری", "اهواز", "اندیکا", "اندیمشک", "باغملک", "بندر امام خمینی", "باوی", "بهبهان", "دشت آزادگان", "دهدز", "دزفول", "گتوند", "هفتکل", "حمیدیه", "هندیجان", "هویزه", "ایذه", "کارون", "خرمشهر", "لالی", "ماهشهر", "مسجد سلیمان", "ملاثانی", "امیدیه", "رامهرمز", "رامشیر", "سربندر", "شادگان", "شهر جدید رامین", "شیرین شهر", "ساکت باش", "شوشتر", "سوسنگرد", "بهمئی", "باشت", "بویراحمد", "چرام", "دانا", "دهدشت", "دوگنبدان", "گچساران", "کهگیلویه", "لنده", "لیکک", "مارگون", "یاسوج", "سوق", "دوگنبدان", "یاسوج", "بانه", "سقز", "سنندج", "مریوان", "باشماق", "آویهنگ", "بانه", "بیجار", "دهگلان", "دیواندره", "گل تپه", "کامیاران", "مریوان", "نگل", "قروه", "سنندج", "سقز", "سروآباد", "شویشه", "یاسوکند", "زرینه", "خرم آباد", "نورآباد", "الشتر", "الیگودرز", "ازنا", "بروجرد", "چگنی", "دلفان", "دورود", "دوره", "کهریز وروشت", "خرم آباد", "کوهدشت", "کونانی", "نور آباد", "پلدختر", "رومشگان", "سلسله", "سپید دشت", "ساوه", "اراک", "آشتیان", "دلیجان", "فراهان", "فرمهین", "غرق آباد", "خمین", "خنداب", "کمیجان", "محلات", "نیم ور", "نوبران", "اشتورجان", "ساوه", "شازند", "تفرش", "زرندیه", "امیرکبیر", "اراک", "چالوس", "فریدون کنار", "نور", "ساری", "بابلسر", "تنکابن", "رامسر", "نوشهر", "بابل", "عباس آباد", "آمل", "بابل", "بابلسر", "بهشهر", "چالوس", "فریدونکنار", "گالوگاه", "هیچرود", "ایزدشهر", "جویبار", "کلارآباد", "کلاردشت", "کیا کلا", "کجور", "محمودآباد", "میاندورود", "نمکابرود", "نکا", "سوادکوه شمالی", "نوشهر", "نور", "قائم شهر", "رامسر", "رویان", "سلمان شهر", "ساری", "سوادکوه", "سیمرغ", "سورک", "تنکابن", "زیراب", "آبگرم", "آبیک", "البرز", "آوج", "بوئین زهرا", "دانسفهان", "حصار", "جودکی", "کشکور", "خرمدشت", "مینودشت الموت", "میر خاوند علیا", "محمدیه", "قزوین", "قروه درجزین", "سنگان سفلی", "شهر صنعتی البرز", "شیرین سو", "تاکستان", "ضیاء آباد", "اقبالیه", "محمدیه", "قزوین", "پردیسان", "قم", "جعفری", "قم", "البرز", "تهران", "گیلان", "گلستان", "مازندران", "ایلام", "خراسان جنوبی", "خراسان رضوی", "خراسان شمالی", "سمنان", "سیستان و بلوچستان", "چهارمحال و بختیاری", "اصفهان", "مرکزی", "قم", "بوشهر", "فارس", "هرمزگان", "کرمان", "یزد", "همدان", "ایلام", "کرمانشاه", "خوزستان", "کهگلویه و بویراحمد", "لرستان", "قزوین", "زنجان", "اردبیل", "آذربایجان غربی", "آذربایجان شرقی", "کردستان", "سمنان", "آرادان", "بیارجمند", "دامغان", "ایوانکی", "گرمسار", "مهدیشهر", "میامی", "سمنان", "شهمیرزاد", "شاهرود", "سرخه", "زاهدان", "ایرانشهر", "چابهار", "بمپور", "بزمان", "چابهار", "دالگان", "فنوج", "هامون", "هیرمند", "ایرانشهر", "کافه بلوچی", "کرند غرب", "خاش", "کنارک", "لاشار", "مهرستان", "میرجاوه", "نیکشهر", "نیمروز", "قصرقند", "رامشار", "سوخاری", "سراوان", "سرباز", "سیب و سوران", "تفتان", "زابل", "ضحاک", "زاهدان", "زرآباد", "ضحاک", "راسک", "نیمروس", "تهران", "اسلامشهر", "شهریار", "پردیس", "لواسان", "ری", "پرند", "اندیشه", "ملارد", "اسلامشهر", "سولقان", "اندیشه", "باقرشهر", "بهارستان", "بومهن", "دماوند", "فشم", "فیروزکوه", "فرودگاه امام خمینی", "قیامدشت", "حسن آباد", "اسلامشهر", "جاجرود", "کهریزک", "خاورشهر", "لواسان", "ملارد", "میگون", "میگون", "نسیم شهر", "پاکدشت", "پرند", "پردیس", "پیشوا", "قرچک", "قدس", "ری", "رباط کریم", "رودهن", "صباشهر", "صالح آباد", "شهر صنعتی شمس آباد", "شهریار", "شمس آباد", "شمیرانات", "شمشک", "شورآباد", "تهران", "ورامین", "واوان", "VPN (M002)", "کنترل کیفیت (M004)", "قراضه (M007)", "B2B - فروش (M008)", "کوه نور (M009)", "Civil and Install (M006)", "مخابرات (M001)", "فروشگاه مودم (M003)", "کاربر _ فروشگاه", "فروشگاه IT-Infra", "فروشگاه مشتریان IT-Infra", "فروشگاه HD", "مشتری _ فروشگاه", "یزد", "ابرکوه", "اردکان", "اشکذر", "بافق", "بهاباد", "چادرملو", "گاریزات", "هرات", "خاتم", "مروست", "مهریز", "میبد", "نصرآباد", "شاهدیه", "تفت", "یزد", "زارچ", "زردین", "زنجان", "انجام تپه", "زرین رود", "زرین آباد", "سعیدآباد", "حلب", "آب بر", "ابهر", "دندی", "گرماب", "هیداج", "ایجرود", "خدابنده", "خرمدره", "ماهنشان", "قره بوته", "قیدار", "سین قلعه", "سلطانیه", "طارم", "زنجان"]

export default function handler(req, res) {
  try {
    const texts = [
      [
        'ایزدشهر پیشگامان سخت افزار تیراژه 424413757-عامل فنی(205)23-03-1402',
      ],
      [
        'ایزدشهر پیشگامان سخت افزار تیراژه 42441315-عامل فنی(205)23-03-1402',
        'ایزدشهر پیشگامان سخت افزار تیراژه 42441197-عامل فنی(205)23-03-1402',
        'تهران پیشگامان سخت افزار تیراژه 42441157-عامل فنی(205)23-03-1402',
      ],
    ];

    // Check if the 'texts' field is present in the request body and it is an array
    if (!texts || !Array.isArray(texts)) {
      return res.status(400).json({ error: 'Missing or invalid required field: texts (array)' });
    }

    // Function to extract request numbers from the input text
    const extractRequestNumbers = (text) => {
      const regex = /\b\d{8,12}\b/g;
      const requestNumbers = text.match(regex);
      return requestNumbers ? requestNumbers[0] : null; // Return the first matched number or null
    };

    // Function to find the agent name that contains the text from the input string
    const findMatchingAgent = (str) => {
      const agentName = agentsObject.agentName.find((agent) => str.includes(agent));
      return agentName || null;
    };

    // Function to find the city name that contains the text from the input string
    const findMatchingCity = (str) => {
      const cityName = citiesArray.find((city) => str.includes(city));
      return cityName || null;
    };

    // Function to find the city key in the citiesData object based on the matched city
    const findMatchingCityKey = (matchedCity) => {
      return Object.keys(citiesData).find((key) => citiesData[key].includes(matchedCity));
    };

    // Set to keep track of encountered request numbers
    const encounteredRequestNumbers = new Set();

    // Process each input text in the array and find the matching agent name, city name, and city key
    const results = texts.map((innerArray) => {
      const innerResults = innerArray.map((text) => {
        const requestNumber = extractRequestNumbers(text);

        // If the request number is repetitive, skip processing this text
        if (encounteredRequestNumbers.has(requestNumber)) {
          return null;
        }

        encounteredRequestNumbers.add(requestNumber);

        const matchedAgent = findMatchingAgent(text);
        const matchedCity = findMatchingCity(text);
        const matchedCityKey = matchedCity ? findMatchingCityKey(matchedCity) : null;

        return {
          text,
          requestNumber,
          agentName: matchedAgent,
          cityName: matchedCity,
          matchedCityKey,
        };
      });

      // Filter out null values (repetitive request numbers) from the inner results
      return innerResults.filter(Boolean);
    }).filter((innerResults) => innerResults.length > 0); // Filter out inner arrays with no results

    // Return the results in the response
    res.status(200).json(results);
  } catch (error) {
    console.error('Error:', error);
    res.status(500).json({ message: 'Server error.' });
  }
}




